SecurityEvent
| where TimeGenerated > ago(7d)
| where EventID == 4720
| project
    TimeGenerated,
    Computer,
    Account,
    SubjectUserName,
    SubjectDomainName,
    TargetUserName,
    TargetDomainName,
    Activity
| order by TimeGenerated asc